Revit 2027 API
FamilySizeTableColumn.GetSpecTypeId Method
 Gets the identifier of the spec describing values in the column.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId GetSpecTypeId()
Public Function GetSpecTypeId As ForgeTypeId
public:
ForgeTypeId^ GetSpecTypeId()
member GetSpecTypeId : unit -> ForgeTypeId
Return Value
ForgeTypeId
 Identifier of the spec.
See Also
Reference
FamilySizeTableColumn Class
Autodesk.Revit.DB Namespace